eisup_2019_docmng_integration/src/Catalogs/абс_ТЭО/абс_ТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ТЭО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТЭО</name>
    <type>
      <types>EnumRef.абс_ВидТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусСогласованияТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщиеИнвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозируемыйРасходПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозируемыйДоходПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительОтДЭИ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.КомиссияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДопСогласование</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойИТР</name>
    <type>
      <types>CatalogRef.абс_ИТР</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТЭО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерSOR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторМП</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>хТТК</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработкиТЭО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВынесенияНаИКК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеТЭО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеБизнеса</name>
    <type>
      <types>CatalogRef.ttk_НаправлениеБизнеса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИТР</name>
    <attributes>
      <name>ИТР</name>
      <type>
        <types>CatalogRef.абс_ИТР</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерИТР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереченьУчастниковСогласованияТЭО</name>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеПоказатели</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовТЭО/абс_ИзменениеСтатусовТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовТЭО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусСогласованияТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидТЭО/абс_ВидТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидТЭО</name>
  <enumValues>
    <name>ТЭО</name>
  </enumValues>
  <enumValues>
    <name>ЭкспрессТЭО</name>
  </enumValues>
  <enumValues>
    <name>БюджетнаяОценка</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусСогласованияТЭО/абс_СтатусСогласованияТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусСогласованияТЭО</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтработан</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПроектов/абс_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПроектов</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДТР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>РазработкаТЭО</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазраоткаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДЭИ</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Эксплуатация</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>ОтказСогласования</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеТЭО</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеСогласование</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ТЭО/ObjectModule.bsl
Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено) Экспорт
	
	ТекПользователь = Ответственный;
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовТЭО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ТЭО.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();

	Запись.ТЭО					= Ссылка;
	Запись.Пользователь 		= ТекПользователь;	
	Запись.Статус				= НовыйСтатус;
	
	Запись.Комментарий 			= Комментарий;
	
	ОтветственныйСотрудник = абс_БизнесПроцессы.ПолучитьСотрудникаПользователя(ТекПользователь);
	
	Если НЕ ОтветственныйСотрудник = Неопределено Тогда
		Запись.ДолжностьОтветственного	= ОтветственныйСотрудник.Должность;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//Вставка 22.01.14 Гетц
	НеИспользоватьБП = Истина;
	//Вставка 22.01.14
	
	СтатусПоРегистру = Справочники.абс_ТЭО.ПолучитьСтатусТЭО(Ссылка);
	
	Если НЕ Статус = СтатусПоРегистру и Не ЭтоГруппа Тогда
		
		ЗаписатьНовыйСтатус(Статус, ПричинаИзмененияСтатуса);
		ОбновитьЗаявкиНаПроект();
		
	КонецЕсли;
	
	Если Не НеИспользоватьБП И Не ЭтоГруппа и Не ВидТЭО = Перечисления.абс_ВидТЭО.БюджетнаяОценка  Тогда   //***** АБС. Гетц 22.01.14 - добавлено НеИспользоватьБП
		//ВСТАВКА Проектный учет 191213 Родин	
		//Бизнес-процессы
		
		БизнесПроцессЗапущен = Ложь;
		
		БПСогласование = НайтиБПСогласование();
		
		Если Статус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
			
			БизнесПроцессЗапущен = Ложь;
			// Запустим БП если он еще не запущен
			
			Если Не ЗначениеЗаполнено(БПСогласование) Тогда
				//Если Не ВидТЭО = Перечисления.абс_ВидТЭО.БюджетнаяОценка Тогда	
					абс_БизнесПроцессы.ЗапуститьБПСогласованияТЭО(Ссылка);
				//КонецЕсли;	
			Иначе
				БизнесПроцессЗапущен = Истина;
			КонецЕсли;	
		КонецЕсли;
		
		Если Статус <> Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
			БизнесПроцессЗапущен = Истина;
		КонецЕсли;	
		
		
		//Закрытие задач
		Если (НЕ Статус = СтатусПоРегистру ИЛИ НЕ ЗначениеЗаполнено(СтатусПоРегистру)) Тогда
			Если БизнесПроцессЗапущен и БПСогласование <> Неопределено Тогда
				// Попробуем закрыть задачу согласования
				ЗадачаСогласование = ПолучитьЗадачуПоТЭО();
				
				Если НЕ ЗадачаСогласование = Неопределено Тогда
					Для Каждого Стр Из ЗадачаСогласование Цикл
						ВыполнитьЗадачуСогласование(Стр);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//ВСТАВКА Проектный учет 191213 Родин	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбновитьЗаявкиНаПроект()
	
	Если Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	абс_ЗаявкаНаПроект.Ссылка
		|ИЗ
		|	Документ.абс_ЗаявкаНаПроект КАК абс_ЗаявкаНаПроект
		|ГДЕ
		|	абс_ЗаявкаНаПроект.ПометкаУдаления = ЛОЖЬ
		|	И абс_ЗаявкаНаПроект.СтатусПроекта = &Статус
		|	И абс_ЗаявкаНаПроект.ТЭО = &Ссылка";
		Запрос.УстановитьПараметр("Статус", Перечисления.абс_СтатусыПроектов.СогласованиеТЭО);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДокО = Выборка.Ссылка.ПолучитьОбъект();
			ДокО.СтатусПроекта = Перечисления.абс_СтатусыПроектов.Согласован;
			Попытка
				ДокО.Записать();
			Исключение
				ОбщегоНазначения.Сообщение(ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
			Документы.абс_ЗаявкаНаПроект.СформироватьНоменклатурныеГруппыИПроекты(ДокО.Ссылка);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры


//ВСТАВКА Проектный учет 191213 Родин	

Функция НайтиБПСогласование() Экспорт
	
	Возврат абс_БизнесПроцессы.НайтиБизнесПроцессПоТЭО(Ссылка);	
	
КонецФункции

Функция НайтиЗадачуПоЗаявке(БизнесПроцесс, ТочкаМаршрута, Исполнитель = Неопределено, ОтборПоИсполнителю = Истина)
	
	ОтборПоИсполнителю = Ложь;
	МассивЗадач = Новый Массив;
	
	ЗапросЗадач = Новый Запрос("ВЫБРАТЬ
	                           |	абсЗадачаДоговора.Ссылка
	                           |ИЗ
	                           |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                           |ГДЕ
	                           |	абсЗадачаДоговора.БизнесПроцесс = &БизнесПроцесс
	                           |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ
	                           |
	                           |УПОРЯДОЧИТЬ ПО
	                           |	абсЗадачаДоговора.Дата УБЫВ");
							   
	ЗапросЗадач.УстановитьПараметр("БизнесПроцесс"		, БизнесПроцесс);
	ЗапросЗадач.УстановитьПараметр("ТочкаМаршрута"		, ТочкаМаршрута);
	ВыборкаЗадач = ЗапросЗадач.Выполнить().Выбрать();
	
	Если ВыборкаЗадач.Следующий() Тогда
		МассивЗадач.Добавить(ВыборкаЗадач.Ссылка);
	КонецЕсли;
	
	Возврат МассивЗадач;
	
КонецФункции

Функция ПолучитьЗадачуПоТЭО() Экспорт
	
	
	БП = НайтиБПСогласование();
	
	Если БП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СпТочек = Новый Массив;
	ТекСтатус = Статус;
	
	Если ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросОработан);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ДействиеПриОтказе);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ  Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.СогласованиеДЭФ);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.РазработкаИТРТЭО);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации  Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ПодготовкаТЭО);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан  Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросИнформации);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО  Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ПодготовкаТЭО);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК  Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.СогласованиеДЭФ);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРДП Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.СогласованиеИК);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.СогласованиеДЭФ);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.РазработкаИТРТЭО);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.СогласованиеИК);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.РазработкаИТРДП);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ПодготовкаТЭО);
	КонецЕсли;	
	
	Возврат НайтиЗадачуПоЗаявке(БП, СпТочек,,Ложь);
	
КонецФункции

Процедура ВыполнитьЗадачуСогласование(ЗадачаСогласование)
	
	Если НЕ ЗадачаСогласование.Выполнена Тогда
		ЗадачаОбъект = ЗадачаСогласование.ПолучитьОбъект();		
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЕсли;	
	
КонецПроцедуры

//ВСТАВКА Проектный учет 191213 Родин	

//АБС ВСТАВКА   14.01.2014 Навценя
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (НЕ ЭтоНовый()) И (Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка) Тогда 
		ПроверяемыеРеквизиты.Добавить("ВидТЭО");
	КонецЕсли;
	
КонецПроцедуры
//АБС ВСТАВКА  КОНЕЦ
